# GetExportLinetypeTable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..GetExportLinetypeTable Method
BaseExportOptions Class See Also
---
Gets a copy of the line type table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLinetypeTable GetExportLinetypeTable()
```

Visual Basic
---
```text
Public Function GetExportLinetypeTable As ExportLinetypeTable
```

Visual C++
---
```text
public:
ExportLinetypeTable^ GetExportLinetypeTable()
```

# ### Return Value
The line type table.
# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace